In [1]:
import pandas as pd

In [2]:
%matplotlib inline

In [3]:
df1 = pd.read_csv('mung1.csv', names=['Denomination', 'Volume'])

In [4]:
df2 = pd.read_csv('mung2.csv', names=['Denomination', 'Volume'])

In [5]:
df1

   Denomination  Volume
0           500       2
1           200       3
2           100       2
3            50      11
4            20       2
5            10       4
6             5       1
7             2       4
8             1       3

In [6]:
df2

   Denomination  Volume
0           500       2
1           200       3
2           100      11
3            50      10
4            20       1
5            10       1
6             5       0
7             2       0
8             1       0

In [7]:
df1['Value'] = df1['Denomination'] * df1['Volume']

In [8]:
df2['Value'] = df2['Denomination'] * df2['Volume']

In [9]:
sum_volume_df1 = sum(list(df1['Volume']))
sum_value_df1 = sum(list(df1['Value']))

sum_volume_df2 = sum(list(df2['Volume']))
sum_value_df2 = sum(list(df2['Value']))

In [10]:
total_df1 = pd.Series(['Total', sum_volume_df1, sum_value_df1], index=['Denomination', 'Volume', 'Value'])
total_df2 = pd.Series(['Total', sum_volume_df2, sum_value_df2], index=['Denomination', 'Volume', 'Value'])

In [12]:
df1

  Denomination  Volume  Value
0          500       2   1000
1          200       3    600
2          100       2    200
3           50      11    550
4           20       2     40
5           10       4     40
6            5       1      5
7            2       4      8
8            1       3      3
9        Total      32   2446

In [11]:
df1 = df1.append(total_df1, ignore_index=True)
df2 = df2.append(total_df2, ignore_index=True)

In [13]:
df2

  Denomination  Volume  Value
0          500       2   1000
1          200       3    600
2          100      11   1100
3           50      10    500
4           20       1     20
5           10       1     10
6            5       0      0
7            2       0      0
8            1       0      0
9        Total      28   3230

In [14]:
total_df = pd.DataFrame({'Denomination': list(df1.to_dict()['Denomination'].values())})

In [15]:
total_df['Volume'] = df1['Volume'] + df2['Volume']

In [16]:
total_df['Value'] = df1['Value'] + df2['Value']

In [17]:
total_df

  Denomination  Volume  Value
0          500       4   2000
1          200       6   1200
2          100      13   1300
3           50      21   1050
4           20       3     60
5           10       5     50
6            5       1      5
7            2       4      8
8            1       3      3
9        Total      60   5676